# ---------- GUI Apps --------------------------------------------------
# 基本ツール
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "iterm2"
cask "docker"           # Docker Desktop (GUI)
cask "zed"

# ワークフロー / 生産性
cask "obsidian"          # Markdown ベース知識管理
cask "google-chrome"     # Chrome ブラウザ
cask "appcleaner"        # アンインストーラ
cask "bambu-studio"      # Bambu Lab スライサー
cask "discord"           # Discord チャット (Cask)
#cask "davinci-resolve-studio" # DaVinci Resolve Studio (要ライセンス)

# ---------- Cloud SDKs -------------------------------------------------
cask "gcloud-cli"        # Google Cloud CLI (Cask 版)

# ---------- CLI Tools --------------------------------------------------
brew "docker"            # docker CLI 本体
brew "ffmpeg"
brew "awscli"            # AWS CLI v2
brew "mas"               # Mac App Store CLI
brew "gh"                # GitHub CLI
brew "asdf"              # ランタイム統合マネージャ
brew "stow"              # dotfiles シンボリックリンク管理

# ---------- Mac App Store (mas) ---------------------------------------
mas "Paste",     id: 967805235   # クリップボードマネージャ
mas "Drafts",    id: 1435957248  # 高速テキスト入力 → どこへでも送出
mas "Tailscale", id: 1475387142  # WireGuard ベース VPN
mas "Messenger", id: 1480068668  # Meta/Facebook Messenger
mas "Yoink",     id: 457622435   # ドラッグ & ドロップ補助棚
mas "Slack",     id: 803453959   # Slack (App Store 版)
mas "Final Cut Pro", id: 424389933 # Video 編集 Mac App Store 版

# ---------- Optional goodies (不要ならコメントアウト) ------------------
# cask "raycast"
# cask "rectangle"
# cask "monitorcontrol"
# cask "stats"
# cask "karabiner-elements"
# cask "shottr"
# cask "orbstack"
# brew "starship"
# brew "fzf"
# brew "ripgrep"
# brew "zoxide"
# brew "dive"
# brew "lazydocker"
